#include <REGX52.H>

//void Timer0Init(void)		//1毫秒@12.000MHz计时器T0
//{
//	TMOD &= 0xF0;		//设置定时器模式，把TMOD的低4位清零，高4位不变
//	TMOD |= 0x01;		//设置定时器模式，将前4位置0，不用T1计时器，用T0，给最低位置1，高4位不变
//	TL0 = 0x18;		//设置定时初值低位=64535%256
//	TH0 = 0xFC;		//设置定时初值高位=64535/256
//	TF0 = 0;		//清除TF0标志，定时器标志=0表示使用它
//	TR0 = 1;		//定时器0开始计时
//	ET0=1;//分开关接通=1
//	EA=1;//总开关=1接通
//	PT0=0;//优先级配置
//}
void Timer0Init(void)		//1毫秒@11.0592MHz计时器T0
{
	TMOD &= 0xF0;		//设置定时器模式，把TMOD的低4位清零，高4位不变
	TMOD |= 0x01;		//设置定时器模式，将前4位置0，不用T1计时器，用T0，给最低位置1，高4位不变
	TL0 = 0x66;		//设置定时初值低位=64535%256
	TH0 = 0xFC;		//设置定时初值高位=64535/256
	TF0 = 0;		//清除TF0标志，定时器标志=0表示使用它
	TR0 = 1;		//定时器0开始计时
	ET0=1;//分开关接通=1
	EA=1;//总开关=1接通
	PT0=0;//优先级配置
}
////void Timer0Init(void)		//1毫秒@12.000MHz计时器T0
////{
////	TMOD = 0x01;	//设置定时器模式，将前4位置0，不用T1计时器，用T0
			//	TR0 = 1;		//定时器0开始计时
////	TL0 = 64535%256;		//设置定时初值低位=64535%256
////	TH0 = 64535/256;		//设置定时初值高位=64535/256与65535相差1000溢出
////	TF0 = 0;		//清除TF0标志，定时器标志=0表示使用它
////	ET0=1;//分开关接通=1
////	EA=1;//总开关=1接通
////	PT0=0;//优先级配置
//}
/*
TMOD=GATE C/T M1 M0//T1计时器 GATE C/T M1 M0//T0计时器

GATE =0->TR0 = 1->TL0->TH0->TF0 = 0->ET0=1->EA=1->PT0=0(可省略)
设置模式->开始计时->设置范围->清除TF0标志->分开关接通=1->总开关=1接通->优先级配置

*/
/*
定时器中断函数模板
void Timer0Routine() interrupt 1//1是T0计时器的中断
{
	static unsigned int T0Count;
	TL0 = 0x18;		//设置定时初值
	TH0 = 0xFC;		//设置定时初值
    T0Count++;
    if(T0Count>=1000)
    {
    T0Count=0;
    }
}
*/
//void main()
//{
//		Timer0_Init();
//	while(1)
//	{
//                               
//	}
//}
//void Timer0Routine() interrupt 1//1是T0计时器的中断
//{
//	static unsigned int T0Count;
//	TL0 = 0x18;		//设置定时初值
//	TH0 = 0xFC;		//设置定时初值
//    T0Count++;
//    if(T0Count>=1000)//隔一秒执行一次
//    {
//    T0Count=0;
//    P1_0=~P1_0;//过1秒变一次
//    }
//}
